{"adaptivetype": "physical", "apiname": "Aphelios", "attack": 6, "be": 6300, "changes": "V10.15", "control": 2, "damage": 3, "date": "2019-12-11", "defense": 2, "difficulty": 3, "herotype": "Marksman", "id": 523, "img": "assets/images/champions/Aphelios/Aphelios.png", "index": 7, "magic": 1, "mobility": 1, "name": "Aphelios", "patch": "V9.24", "rangetype": "Ranged", "resource": "Mana", "rp": 975, "skill_e": {"1": "Weapon Queue System", "img": "assets/images/champions/Aphelios/Weapon Queue System.png", "tooltip": "The icon of this ability reflects the next weapon that is the next in the queue.", "maxrank": 6, "ability_breakdown": []}, "skill_i": {"1": "The Hitman and the Seer", "2": "Calibrum", "3": "Severum", "4": "Gravitum", "5": "Infernum", "6": "Crescendum", "img": "assets/images/champions/Aphelios/The Hitman and the Seer.png", "tooltip": "Innate:  Aphelios wields 5 Lunari Weapons made by his sister Alune. He has access to two at a time: main weapon and off-hand weapon. Each weapon has a unique  basic attack and active ability.<br><br>Innate - Precision:  Aphelios has  bonus range while Calibrum is his main weapon. Abilities will mark targets, and he may attack them from far away with the current off-hand weapon, consuming the mark and dealing bonus physical damage.<br><br>Innate - Resurgent:  Aphelios'  basic attacks will  heal him. Additionally, create a  shield from excess healing.<br><br>Innate - Binding:  Aphelios's  basic attacks apply a decaying  slow on his targets on-hit.<br><br>Innate - Incendiary:  Aphelios'  basic attacks will hit everyone, then spreads in a cone behind his main target.<br><br>Innate - Arcing:  Aphelios throws a chakram as his  basic attack. He can't attack until it came back to him. Other abilities will create mirror chakrams that he accumulates, and uses them to empower his damage.", "ability_breakdown": [{"main": [{"attribute": "Bonus Attack Damage", "string_expression": ["4", "8", "12", "16", "20", "24"]}, {"attribute": "Bonus Attack Speed", "string_expression": ["6%", "12%", "18%", "24%", "30%", "36%"]}, {"attribute": "Lethality", "string_expression": ["2", "4", "6", "8", "10", "12"]}], "name": "The Hitman and the Seer"}]}, "skill_q": {"1": "Weapons of the Faithful", "2": "Moonshot", "3": "Onslaught", "4": "Binding Eclipse", "5": "Duskwave", "6": "Sentry", "img": "assets/images/champions/Aphelios/Weapons of the Faithful.png", "tooltip": "The active effect of  Aphelios'  varies based on his current main weapon.\n Calibrum -  Moonshot: Long range shot that marks its target for a long-range follow-up attack.\n Severum -  Onslaught: Gain  bonus movement speed while attacking a single enemy with both weapons.\n Gravitum -  Binding Eclipse:  Root all enemies who are * slowed by this weapon.\n Infernum -  Duskwave: Blast enemies in a cone and attack them with your off-hand weapon.\n Crescendum -  Sentry: Deploy a sentry that shoots your off-hand weapon.<br><br>Active:  Aphelios fires a bolt of energy in a line, dealing physical damage and marks the first enemy hit.<br><br>Active:  Aphelios gains  bonus movement speed and quickly attacks a target with Severum and his current off-hand weapon dealing physical damage to them.<br><br>Active:  Aphelios deals magic damage and roots all targets that are  slowed by Gravitum.<br><br>Active:  Aphelios unleases a wave of energy in a cone, dealing physical damage to all enemies hit and locking on to each of them. After a delay he  basic attack all locked targets.<br><br>Active:  Aphelios deploys lunar sentry that uses his off-hand weapon. It attacks nearby enemies dealing physical damage.", "maxrank": 6, "ability_breakdown": []}, "skill_r": {"1": "Moonlight Vigil", "img": "assets/images/champions/Aphelios/Moonlight Vigil.png", "tooltip": "Active:  Aphelios fires a concentrated blast of moonlight that explodes on enemy  champions dealing physical damage. Then  basic attacks raining from the sky to them, dealing physical damage and applying unique effects of his main weapon.\n Calibrum: Applies an empowered mark on all target.\n Severum: The initial blast  heals him, and so does the attacks.\n Gravitum: An empowered  slow applied on all target.\n Infernum: The initial blast deals increased damage, and the attacks splashes on each target.\n Crescendum:  Aphelios gains more mirror chakrams the more target he hit with the initial blast.", "maxrank": 3, "ability_breakdown": []}, "skill_w": {"1": "Phase", "img": "assets/images/champions/Aphelios/Phase.png", "tooltip": "Active: Aphelios switches between his main weapon and off-hand weapon.", "maxrank": 6, "ability_breakdown": []}, "stats": {"ls": 0, "spell_vamp": 0, "apen": 0, "apen%": 0, "mpen": 0, "mpen%": 0, "critdmg": 0, "tenacity": 0, "heal_shield": 0, "ad_base": 57, "ad_lvl": 2, "arm_base": 28, "arm_lvl": 3, "as_base": 0.64, "as_lvl": 2.1, "as_ratio": 0.6399999856948853, "attack_cast_time": 0.23000000417232513, "attack_total_time": 1.5, "hp5_base": 3.25, "hp5_lvl": 0.55, "hp_base": 530, "hp_lvl": 88, "mp5_base": 6.5, "mp5_lvl": 0.4, "mp_base": 348, "mp_lvl": 42, "mr_base": 26, "mr_lvl": 0.5, "ms": 325, "ms_base": 325, "ofa_dmg_dealt": 1.05, "pathing_radius": 35, "range": 550, "selection_radius": 110, "urf_dmg_taken": 0.95}, "style": 20, "title": "the Weapon of the Faithful", "toughness": 1, "utility": 1}