{
	"Ezreal_skill_w": "Ezreal fires an orb that sticks to the first champion or objective hit. If Ezreal hits an enemy with the orb, it detonates and deals damage.",
	"Fiddlesticks_skill_i": "Fiddlestick can summon an effigy of himself which occupies his trinket slot. This can reveal and disable wards and stealthed traps.",
	"Fiddlesticks_skill_q": "Damaging enemies with spells while unseen or targeting an enemy with Terrify's activation hits a target with fear, causing the target to flee in fear for a duration",
	"Fiddlesticks_skill_w": "Fiddlestick drains health from nearby enemies, dealing bonus execute damage at the end of the duration",
	"Fiddlesticks_skill_e": "Fiddlesticks slashes and area with its scythe. All enemies hit are slowed and those hit in the center are silenced.",
	"Fiddlesticks_skill_r": "Fiddle sticks blinks to the target location dealing damage in a circle around him.",
	"Fizz_skill_i": "Fizz ignores unit collision and takes reduced damage from each tick of damage up to 50%.",
	"Irelia_skill_i": "Irelia gains a stack of Ionian Fervor for every target hit by her abilities, stacking up to 5 times and lasting for a few seconds. This grants her bonus Attack Speed and Magic Damage on-hit which increases in the number of stacks.",
	"Irelia_skill_q": "Irelia dashes forward striking a target and healing herself. If the target is Marked or dies to Bladesurge, its cooldown is reset.",
	"Irelia_skill_w": "Irelia charges a strike that reduces physical damage taken while charging and deals more damage as it progresses.",
	"Irelia_skill_e": "Irelia sens out two blades which converge on each other. Enemies caught in between are damaged, stunned, and Marked.",
	"Irelia_skill_r": "Irelia launches a barrage of blades in the target direction, expanding outward once a champion has been hit, slowing and dealing magic damage all targets hit.",
	"Kaisa_skill_i": "Kai'Sa's basic attacks deal bonus magic depending on the number of Plasma stacks. Plasma can be stacked by her basic attacks, nearby allies' immobilizing effects, or Void Seeker up to 4 stacks. Kai'Sa can consume the 4th stack dealing bonus magic damage. Kai'Sa can also evolve her abilities depending on her stats.",
	"Kaisa_skill_q": "Kai'Sa shoots a swarm of missiles that seek out nearby targets. When upgraded, Icathian Rain shoots more missiles.",
	"Kaisa_skill_w": "Kai'Sa shoots a long range missle, marking enemies with her passive. When upgraded, Void Seeker applies more passive marks and reduces the cooldown when a champion is hit.",
	"Kaisa_skill_e": "Kai'Sa increases her movement speed and attack speed. When upgraded, Supercharge grants her brief invisiblity.",
	"Kaisa_skill_r": "Kai'Sa dashes to a target location to an visible enemy champion affected by Plasma, shielding herself while dashing.",
	"Kled_skill_i": "Kled is mounted on Skaarl and while mounted, Skaarl takes damage. Once Skaarl loses all of his health, Skaarl flees and Kled is dismounted cleansing him and making him invulnerable and untargetable for a few seconds. Kled can remount himself by gaining enough Courage from landing abilities and other sources.",
	"Kled_skill_e": "When mounted, Kled dashes dealing physical damage and gaining a short burst of speed. Kled can cast this ability to dash back through his initial target, dealing the same damage.",
	"Kled_skill_r": "When mounted, Kled and Skaarl charges to the target location granting lots of bonus Movement Speed to the duo and ally champions. Skaarl homes in on the first enemy champion, dealing damage and knocking them back.",
	"Leblanc_skill_q": "LeBlanc projects a sigil, dealing damage and marking the target for a short duration. Damaging the marked target with any ability detonates the sigil, dealing additional damage.",
	"Leblanc_skill_r": "LeBlanc can recast any of abiliites a second time.",
	"Lillia_skill_i": "Lillia's abilities apply Dream Dust which deals magic damage over a few seconds.",
	"Lillia_skill_q": "Passively, Lillia gains stacking movement speed when hitting enemies with spells. She can activate this to deal magic damage enemies around her in a circle, dealing extra true damage on the edge.",
	"Lillia_skill_w": "Lillia deals damage in a nearby area, dealing heavy damage in the center.",
	"Lillia_skill_e": "Lillia hurls a seed that damages and slows those it lands on. It will roll indefinitely unless it hits a wall or a target.",
	"Lillia_skill_r": "Lillia renders all champions affected by Dream Dust drowsy, slowing them for a few seconds then making them fall asleep afterwards.",
	"Lissandra_skill_i": "Whenever an enemy champion dies while Lissandra is near, an invulnerable and untargetable ice spirit chases nearby visible enemies, slowing and dealing magic damage after a few seconds.",
	"Mordekaiser_skill_i": "Mordekaiser's basic attacks deal bonus magic damage on-hit. Damaging enemy champions grants stacks and on 3 stacks, he deals bonus damage in an area around him for a few seconds.",
	"Mordekaiser_skill_q": "Mordekaiser smashes the ground with his mace dealing magic damage to all enemies struck. Damage is increased when hitting a single enemy.",
	"Mordekaiser_skill_w": "Mordekaiser stores damage he deals and takes. Activating this ability creates a shield that he can activate again to consume the shield and heal.",
	"Mordekaiser_skill_e": "Mordekaiser pulls all enemies in an area.",
	"Mordekaiser_skill_r": "Mordekaiser sends the targeted champion into the Death Realm for a few seconds, stealing some of their stats.",
	"Neeko_skill_w": "Neeko passively deals bonus magic damage every third attack. Neeko can activate this ability to send a clone in the chosen direction.",
	"Neeko_skill_e": "Neeko shoots a tangle, dealing damage and rooting evrything it passes through. If the tangle kills an enemy or passes through a champion, it becomes larger, faster, and roots for longer.",
	"Neeko_skill_r": "Neeko leaps up and charges a blossom shielding her for a few seconds. Upon landing, she deals magic damage and stuns enemies within her blast radius.",
	"Nunu_skill_i": "Nunu and Willump and the nearest allied champion gains bonus Attack Speed and bonus Movement Speed. Willump gans bonus physical damage to enemies behind the target.",
	"Nunu_skill_q": "Nunu consumes a minion, monster, or enemy champion dealing damage and healing a portion of the damage.",
	"Nunu_skill_w": "Willump creates a snowball that grows in size and speed as he rolls it. The snowball explodes when hitting terrain or champions, damaging and knocking up enemies that are hit.",
	"Nunu_skill_e": "Nunu throws multiple snowballs that damage enemies. When he's finished, Willump roots any champions or large monsters that were hit by a snowball.",
	"Nunu_skill_r": "Nunu and Willump start channeling for a few seconds, slowing enemies and gaining a shield. At the end of the duration or if the channel is interrupted, enemies takes magic damage.",
	"Pyke_skill_i": "Pyke cannot increase his Maximum Health, instead gaining bonus Attack Damage for it. A portion of the damage taken is stored as Grey Health which he can consume to rapidly heal the same amount.",
	"Pyke_skill_q": "Pyke readies his skewer, stabbing before finishing the charge or pulling an enemy towards him, both dealing physical damage.",
	"Pyke_skill_w": "Pyke enters Camouflage and gains significant movement speed that decays over time.",
	"Pyke_skill_e": "Pyke dashes and leaves behind him a phant that returns to him, stunning enemy champions along its path.",
	"Pyke_skill_r": "Pyke targets an area with an X and executes enemy champions below a threshold, granting full gold to him and the last assisting ally. If champions are not below the threshold, he deals some physical damage.",
	"Qiyana_skill_i": "Qiyana's basic attacks and damaging abilities deal bonus physical damage.",
	"Qiyana_skill_q": "Qiyana swings her weapoon, dealing damage with a bonus effect based on the chosen element.",
	"Qiyana_skill_w": "Qiyana dashes to a target location and enchants her weapon with an element. Her attacks and abilities deal bonus damage while her weapon is enchanted.",
	"Qiyana_skill_e": "Qiyana dashes to an enemy and damaging them.",
	"Qiyana_skill_r": "Qiyana sends a windblast in the target directions knocking back enemies and stopping upon hitting terrain. This sends a shockwave around the border of the terrain dealing damage and stunning any targets hit.",
	"Rengar_skill_q": "Rengar's next attack stabs his target for bonus damage. If Rengar has full ferocity, he deals increased damage and grants extra Attack Speed.",
	"Sett_skill_i": "Sett alternates between a Left Punch and a Right Punch when attacking. His Right PUnch gains bonus range, attacks faster, and deals bonus physical damage. Sett also regenerates health depending on his missing health.",
	"Sett_skill_q": "Sett's next two auto attacks deal additional damage based off the target's max health. Sett also gains movement speed while moving towards enemy champions.",
	"Sett_skill_w": "Sett passively stores damage he takes as Grit. When cast, Sett expends all stored Grit to gain a shield and punch an area, dealing true damage in the center and physical damage on the sides.",
	"Sett_skill_e": "Sett pulls in all enemies on opposite sites of him, dealing damage and stunning them. If enemies were only on one side, they are slowed instead of stunned.",
	"Sett_skill_r": "Setts dashes, becoming unstoppable, suppressing and slamming a target champion into the ground. Enemies within the impact area take physical damage.",
	"Swain_skill_w": "Swain summons an eye at the target location, revealing an area and dealing magic damage and slowing enemies after a few seconds.",
	"Sylas_skill_i": "Sylas stacks of Unshackled for every every ability cast. He gains bonus Attack Speed and his next basic attack deals damage around him, consuming a stack of Unshackled.",
	"Sylas_skill_q": "Sylas lashes his chains out, intersecting at his targeted location dealing damaging and slowing enemies hit. After a short delay, the targeted location's intersection point explodes dealing extra damage.",
	"Sylas_skill_w": "Sylas lunges at an enemy dealing execute based damage and healing himself against enemy champions.",
	"Sylas_skill_e": "Sylas dashes to a location. When recast, he throws his chains out, pulling himself to any enemy he htis and knocks them up for short duration.",
	"Sylas_skill_r": "Sylas steals any target ultimate. Sylas can only steal ultimates that have not been stolen before for a few seconds.",
	"Volibear_skill_i": "Volibear gains stacks of Relentless Storm, granting him bonus Attack Speed whenever he damages an enemy with basic attacks or abilities. At max stacks, he does chain lightning damage to the 4 nearest visible targets.",
	"Volibear_skill_q": "Volibear gains speed towards enemies, stunning and damaging the first one he attacks.",
	"Volibear_skill_w": "Volibear damages an enemy, applying on-hit effects and marking them. Casting this spell again on the same target deals bonus damage and heals Volibear.",
	"Volibear_skill_e": "Volibear summons a lightning bolt at a location dealing damagte and slowing enemies while granting Volibear a shield if he's inside the blast radius.",
	"Volibear_skill_r": "Volibear leaps to the target location, granting him immunity to Crowd Control, unit collision, and granting him bonus Health, range, and increased size. If he targets an enemy structure, it renders it unable to attack.",
	"MonkeyKing_skill_i": "Wukong gains bonus Armor per level and regenerates extra health, growing whenever a champion or monster is hit.",
	"MonkeyKing_skill_w": "Wukong becomes invisible and dashes in a direction, leaving behind a clone that will attack nearby enemies and cast his Crushing Blow if the real one does.",
	"Yone_skill_i": "Yone doubles his total Critical Hit Chance, but only critical strikes deal less daamge. Yone's basic attacks alternate, dealing physical damage with his Steel Sword and magic damage with the other.",
	"Yone_skill_q": "Yone thrusts his sword, damaging all enemies in a line. When a target is hit, Mortal Steel grants a stack of Gathering Storm for a few seconds. At 2 stacks, Mortal Steel dashes Yone forward knocking enemies Airborne. ",
	"Yone_skill_w": "Yone cleaves an area in front of him, damaging all enemies in a cone. This grants Yone a shield which icnreases on the number of champions hit. The cooldown and cast time scale with Attack Speed.",
	"Yone_skill_e": "Yone's spirit leaves his body behind, gaining movement speed. When the duration ends or when recast, Yone's spirit is forced back to his body and he repeats a portion of the damage his spirit dealt.",
	"Yone_skill_r": "Yone marks a line in the target directions, stunning targets and blinking in the direction. Any enemies hit are dealt both physical and magical damage, pulling them in and knocked them up.",
	"Yuumi_skill_q": "Yuumi fires a missle dealing damage to the first target hit. While attached, the missile can be controlled by your cursor. It deals bonus damage and slows if it takes at least 1 second to get to its target.",
	"Yuumi_skill_w": "Passively, Yuumi increases her ally's Adaptive Force and her own. Actively, Yuumi dashes and attaches to a target ally, becoming untargetable from everything except turrets.",
	"Yuumi_skill_e": "Yuumi heals herself and boosts her Movement Speed and Attack Speed. While attached, shes heals her attached ally.",
	"Yuumi_skill_r": "Yuumi launches waves in the target directions, dealing magic damage, reduced by subsequent waves, to enemy champions. When struck by three waves, they are rooted, occuring once per target.",
	"Zac_skill_r": "Passively, Zac's blobs grant extra healing. Actively, Zac bounces, gaining bonus Movement Speed, dealing magic damage and knocking them back and slowing them for a short duration."
}